review/EOS/Mcdougall_et_al_2003.org
#+TITLE: Mcdougall et al (2003) ノート
#+AUTHOR: KAWAI Yuta
#+LANGUAGE: ja
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./../org.css" />

#+begin_abstract
Feistel and Hagen(FH) の状態方程式と良くフィットする, 25 項から成る海水の状態方程式を示す. 
この状態方程式は, 効率的な海洋もデルの積分のために, (現場温度よりむしろ)温位を使ってかかれる. 
FH とのフィッティングの最大誤差は, 海洋学的な温度・圧力・塩分範囲で, 3*10^-3 kgm-3 である. 
対応する熱膨張率の最大誤差は, 4*10^-7 ℃-1 であり, FH の状態方程式と国際状態方程式間の最大差の 1/12 倍である. 

FH のギブス関数に基づく比エントロピーを使った, 温位と現場温度の変換手法を示す. 
それによって得られる温位の値は, 国際状態方程式から導かれる断熱減率に基づく温位よりずっと精度が良い. 
#+end_abstract

* イントロダクション
**  海洋モデルにおける状態方程式
  - 海洋モデルは塩分と温位の保存方程式を使うので, 状態方程式は温度・温位・圧力の関数である. 
    - Jackett and McDougall(1995) (JM95) の状態方程式 
      - 国際状態方程式(Fofonoff and Millard, 1983) (FM83) と同じ係数の数(41個!)
        - 対照的に, 国際状態方程式は温度・現場温度・圧力の関数
    - Wright(1997) の状態方程式 (W97)
      - 係数がたった 15 個のため, 計算効率は高い
      - しかし, 国際状態方程式との偏差が JM95 よりも大きいので, 
        大部分のモデルグループが JM 95 の式を使う. 

** 国際状態方程式より精度の良い状態方程式
   - 国際状態方程式(FM83) は, もはや最も精度の良い状態方程式でない
   - Feistel(1993) (F93) の状態方程式
     - ギブスポテンシャルを決定するために, さまざまな熱力学的量を使う方法を提案
     - 内部エネルギー, エンタルピー, 比熱, エントロピー, 比容, 化学ポテンシャル, 温位, 音速他は, 
       ギブスポテンシャルから導かれる. 
     - 導かれる量は, 全体的に self-consistent である. 
   - Feistel and Hagen (1995) (FH95) の状態方程式
     - F93 の方法に加え, 最大密度の温度と音速データを組み入れることで, 
       国際状態方程式より精度良い状態方程式になった.     
     - 計算負荷が大きいことが欠点である. 
       - Mcdougall et al(2003) の研究動機

** Mcdougall et al(2003) について
*** あらすじ
   - 目的: FH95 のギブス関数による精度の向上を取り込みつつ, 計算効率の良い状態方程式を導く
   - 方法
     - 計算効率のため W97 の有理関数の方法を使う. 
     - 精度改善のために項数を追加する. 
   - 結果
     - 最終的に全項数は 25 個 (< JM95 の 41 個)のため計算効率が向上
     - JM95 との相対的な誤差は, W97 の 1/15~1/20

*** その他のこと
   - 提案する状態方程式は, 実験値よりむしろ FH95 にフィッティングした
     - 十分な項数があるので, フィッティングの誤差は FH95 のギブス関数の
       フィッティングに使った実験値の不確実性である. 
   - 海水の塩の組成の変化の考慮はここでは行わず, 今後の課題にしている. 
   - 現場温度と温位の変換は, FH95 のギブス関数の手法を介して一番精度良く関係付けられる


